Repository: elebihan/python-ptraceplus
Catalog: po/*.po
Languages: fr

source: arguments of the program
fr: arguments du programme

source: trace only execution
fr: trace seulement l'exécution

source: get arguments during execution
fr: récupère les arguments lors de l'exécution

source: trace file access during execution
fr: trace les accès fichiers lors de l'exécution

source: compute some statistics
fr: calcule des statistiques

source: trace all events
fr: trace tous les événements

source: set output file
fr: définit le fichier de sortie

source: filter syscall by name
fr: filtre un appel système par son nom

source: filter program by name
fr: filtre un programme par son nom

source: Missing argument(s)
fr: Argument(s) manquant(s)

source: Error: {}
fr: Erreur : {}

source: Number of processes traced: {}
fr: Nombre de processus tracés : {}

source: Number of processes filtered: {}
fr: Nombre de processus filtrés : {}

source: Syscalls statistics:
fr: Statistiques des appels système :

source: [{}] starting
fr: [{}] démarre

source: [{}] forked as {}
fr: [{}] forké en {}

source: [{}] received signal {} {}
fr: [{}] a reçu le signal {} {}

source: [{}] is about to exit with status {}
fr: [{}] prêt à se terminer avec le status {}

source: [{}] has exited with code {}
fr: [{}] terminé avec le code {}

source: [{}] killed by signal {}
fr: [{}] tué par le signal {}

source: Unknown event for {} ({})
fr: Évènement inconnu pour {} ({})

source: Attaching {}
fr: Attachement de {}

source: Detaching {}
fr: Détachement de {}

source: unknown
fr: inconnu

source: enter
fr: entrée

source: exit
fr: sortie

source: can not get '{} {}' for {}() at {:#x}
fr: impossible de lire '{} {}' pour {}() en {:#x}

source: Unsupported architecture
fr: Architecture non supportée

source: Unsupported system
fr: Système non supporté

source: Process {} already registered
fr: Processus {} déjà enregistré

source: Adding process {}
fr: Ajout du processus {}

source: Remembering process {}
fr: Rappel du processus {}

source: Keeping process {} {}
fr: Mémorisation du processus {} {}

source: Removing process {}
fr: Retrait du processus {}

source: Process not found
fr: Processus introuvable

source: {} processes still traced
fr: {} processus toujours tracés

source: Unknown PID ({})
fr: PID inconnu ({})

source: Program not found
fr: Programme introuvable

source: Spawned process {}
fr: Génération du processus {}

source: Failed to trace child process {}
fr: Impossible de tracer le processus fils
